src/Enums/ТипыДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДокументовЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВзаимозачета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ведомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУКД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУПД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКоммерческихПредложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОбОшибкеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческоеПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОператораЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеКАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПринятииКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКвитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПроизвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемкиСтроительныхРаботУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПредприятия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ИнтеграцияShareУТ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ИнтеграцияShareПереопределяемый.КонтактныеЛицаСНомеромТелефона.
Процедура КонтактныеЛицаСНомеромТелефона(Знач Контрагент, КонтактнаяИнформация) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;

	КонтактноеЛицоКонтрагента = ПартнерыИКонтрагенты.ПолучитьКонтактноеЛицоПартнераКонтрагентаПоУмолчанию(Контрагент);
	КонтактноеЛицоИКонтрагент = Новый Массив;
	КонтактноеЛицоИКонтрагент.Добавить(Контрагент);
	КонтактноеЛицоИКонтрагент.Добавить(КонтактноеЛицоКонтрагента);
	
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);

	ОтборКонтактнойИнформации = УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации();
	ОтборКонтактнойИнформации.ТипыКонтактнойИнформации = ВидыКИ;
	ОтборКонтактнойИнформации.Дата = ТекущаяДатаСеанса();
	
	КонтактнаяИнформацияДляСервиса = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(КонтактноеЛицоИКонтрагент, ОтборКонтактнойИнформации);
	
	Для Каждого НайденныйКонтакт Из КонтактнаяИнформацияДляСервиса Цикл
		Контакт = ИнтеграцияShareКлиентСервер.НовыйКонтактнаяИнформация();
		Контакт.ВладелецКонтакта      = НайденныйКонтакт.Объект;
		Контакт.НомерТелефонаБезКодов = БезКодаСтраныРФ(НайденныйКонтакт.Значение);
		
		КонтактнаяИнформация.Добавить(Контакт);
	КонецЦикла;
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииСоставаКомандShare.
Процедура ПриОпределенииСоставаКомандShare(СоставКоманд) Экспорт

	СоставКоманд.Исходящие.Добавить(Метаданные.Документы.ЗаказКлиента.ПолноеИмя());
	СоставКоманд.Исходящие.Добавить(Метаданные.Документы.ЗаказПоставщику.ПолноеИмя());
	СоставКоманд.Исходящие.Добавить(Метаданные.Документы.СчетНаОплатуКлиенту.ПолноеИмя());

	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаказКлиента.ПолноеИмя());
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаказПоставщику.ПолноеИмя());
	СоставКоманд.Входящие.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());

КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииГиперссылкиНаИнструкциюПоРаботеССервисом.
Процедура ПриОпределенииГиперссылкиНаИнструкциюПоРаботеССервисом(НавигационнаяСсылка) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииФайловДокументаДляВыбораКПубликации.
Процедура ПриОпределенииФайловДокументаДляВыбораКПубликации(ДанныеФайлов, Знач СсылкаНаДокумент, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииДанныхПубликуемогоДокумента.
Процедура ПриОпределенииДанныхПубликуемогоДокумента(ДанныеТранспортногоКонтейнера, Знач СсылкаНаДокумент) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииВизуализацииПубликуемогоДокумента.
Процедура ПриОпределенииВизуализацииПубликуемогоДокумента(ОписаниеПредставленияДокумента,
	Знач ПараметрыПубликуемогоДокументаДляВизуализации, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ЗаполнитьНастройкиФормированияДокумента.
Процедура ЗаполнитьНастройкиФормированияДокумента(СсылкаНаДокумент, НастройкиФормирования) Экспорт
	
	ПоддерживаемыеФорматыЭДО = ОбменСКонтрагентами.ФорматыДокументов();
	ТипыДокументов           = ОбменСКонтрагентами.ТипыДокументов();
	НаправленияДокументов    = ОбменСКонтрагентами.НаправленияДокументов();
	
	ТипИсточника = ТипЗнч(СсылкаНаДокумент);

	Если ТипИсточника = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Реквизиты = "Организация, Контрагент, Договор";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
		
		НастройкиФормирования.ТипДокумента       = ТипыДокументов.ЗаказТовара;
		НастройкиФормирования.Формат             = ПоддерживаемыеФорматыЭДО.CML208;
		НастройкиФормирования.Направление        = НаправленияДокументов.Исходящий;
		НастройкиФормирования.Организация        = ЗначенияРеквизитов.Организация;
		НастройкиФормирования.Контрагент         = ЗначенияРеквизитов.Контрагент;
		НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.Договор;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Реквизиты = "Организация, Контрагент, Договор";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
		
		НастройкиФормирования.ТипДокумента       = ТипыДокументов.ОтветНаЗаказ;
		НастройкиФормирования.Формат             = ПоддерживаемыеФорматыЭДО.CML208;
		НастройкиФормирования.Направление        = НаправленияДокументов.Исходящий;
		НастройкиФормирования.Организация        = ЗначенияРеквизитов.Организация;
		НастройкиФормирования.Контрагент         = ЗначенияРеквизитов.Контрагент;
		НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.Договор;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетНаОплатуКлиенту") Тогда
		
		Реквизиты = "Организация, Контрагент, Договор";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
		
		НастройкиФормирования.ТипДокумента       = ТипыДокументов.СчетНаОплату;
		НастройкиФормирования.Формат             = ПоддерживаемыеФорматыЭДО.CML208;
		НастройкиФормирования.Направление        = НаправленияДокументов.Исходящий;
		НастройкиФормирования.Организация        = ЗначенияРеквизитов.Организация;
		НастройкиФормирования.Контрагент         = ЗначенияРеквизитов.Контрагент;
		НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.Договор;

	КонецЕсли;

КонецПроцедуры

// См. ИнтеграцияShareПереопределяемый.ПриОпределенииНастроекЗагрузкиДокумента.
Процедура ПриОпределенииНастроекЗагрузкиДокумента(НастройкиЗагрузки, Знач ОписаниеЭлектронногоДокумента) Экспорт

	Если Не ЗначениеЗаполнено(ОписаниеЭлектронногоДокумента.СведенияОЗагруженномДокументе.ОбъектУчета)
							И ОписаниеЭлектронногоДокумента.ТипДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату Тогда
							
		ПараметрыОтраженияВУчете = НастройкиЗагрузки.ПараметрыОтраженияВУчете;
		ПараметрыОтраженияВУчете.Очистить();
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств") Тогда
			НовыйПараметрОтраженияВУчете = ПараметрыОтраженияВУчете.Добавить();
			
			ПредставлениеДокумента   = СтрШаблон(НСтр("ru = '%1 от %2'",
				ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеЭлектронногоДокумента.ПредставлениеДокументаОтправителя,
				ОписаниеЭлектронногоДокумента.НаименованиеОтправителя);
			
			НовыйПараметрОтраженияВУчете.СпособОтраженияВУчете    = "ЗаявкаНаРасходованиеДенежныхСредств";
			НовыйПараметрОтраженияВУчете.ПредставлениеДокумента   = ПредставлениеДокумента;
			НовыйПараметрОтраженияВУчете.КартинкаРезультатаПоиска = БиблиотекаКартинок.ЗагрузитьShare;
			НовыйПараметрОтраженияВУчете.ПредставлениеВПодменюЗагрузить = СтрШаблон(НСтр("ru = 'Как %1'",
				ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru = 'Заявка на расходование денежных средств'"));
			НовыйПараметрОтраженияВУчете.ПредставлениеРезультатаПоиска = СтрШаблон(НСтр("ru = 'Загрузить как %1'",
				ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru = 'Заявка на расходование денежных средств'"));
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыПоставщикам") Тогда
			НовыйПараметрОтраженияВУчете = ПараметрыОтраженияВУчете.Добавить();
			
			ПредставлениеДокумента   = СтрШаблон(НСтр("ru = '%1 от %2'",
				ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеЭлектронногоДокумента.ПредставлениеДокументаОтправителя,
				ОписаниеЭлектронногоДокумента.НаименованиеОтправителя);
			
			НовыйПараметрОтраженияВУчете.СпособОтраженияВУчете    = "ЗаказПоставщику";
			НовыйПараметрОтраженияВУчете.ПредставлениеДокумента   = ПредставлениеДокумента;
			НовыйПараметрОтраженияВУчете.КартинкаРезультатаПоиска = БиблиотекаКартинок.ЗагрузитьShare;
			НовыйПараметрОтраженияВУчете.ПредставлениеВПодменюЗагрузить = СтрШаблон(НСтр("ru = 'Как %1'",
				ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru = 'Заказ поставщику'"));
			НовыйПараметрОтраженияВУчете.ПредставлениеРезультатаПоиска = СтрШаблон(НСтр("ru = 'Загрузить как %1'",
				ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru = 'Заказ поставщику'"));
		КонецЕсли;

		НовыйПараметрОтраженияВУчете = ПараметрыОтраженияВУчете.Добавить();
			
		ПредставлениеДокумента   = СтрШаблон(НСтр("ru = '%1 от %2'",
			ОбщегоНазначения.КодОсновногоЯзыка()), ОписаниеЭлектронногоДокумента.ПредставлениеДокументаОтправителя,
			ОписаниеЭлектронногоДокумента.НаименованиеОтправителя);
			
		НовыйПараметрОтраженияВУчете.СпособОтраженияВУчете    = "СписаниеБезналичныхДенежныхСредств";
		НовыйПараметрОтраженияВУчете.ПредставлениеДокумента   = ПредставлениеДокумента;
		НовыйПараметрОтраженияВУчете.КартинкаРезультатаПоиска = БиблиотекаКартинок.ЗагрузитьShare;
		НовыйПараметрОтраженияВУчете.ПредставлениеВПодменюЗагрузить = СтрШаблон(НСтр("ru = 'Как %1'",
			ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru = 'Списание безналичных денежных средств'"));
		НовыйПараметрОтраженияВУчете.ПредставлениеРезультатаПоиска = СтрШаблон(НСтр("ru = 'Загрузить как %1'",
			ОбщегоНазначения.КодОсновногоЯзыка()), НСтр("ru = 'Списание безналичных денежных средств'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция БезКодаСтраныРФ(Знач НомерТелефона)
	
	Если СтрДлина(НомерТелефона) > 0 И СтрНачинаетсяС(НомерТелефона, "7") Тогда
		НомерТелефона = Сред(НомерТелефона, 2);
	КонецЕсли;
	
	Возврат НомерТелефона;
	
КонецФункции

#КонецОбласти
